000100 01 WS-VARIABLES.                                                 00010000
000200    05 WS-PD2                          PIC S9(5) COMP-3.          00020002
000300    05 WS-EDITED2                      PIC +(6).                  00030002
