000100 01 WS-VARIABLES.                                                 00010000
000200    05 WS-PD                           PIC S9(5) COMP-3.          00020000
000300    05 WS-EDITED                       PIC +(6).                  00030000
000300    05 WS-EDITED                       PIC +(6).                  00040000
